In [4]:
import pandas as pd
# 결측치 만들기 nan = 결측치
import numpy as np
np.nan

nan

In [6]:
df = pd.DataFrame({'sex' : ['M', 'F', np.nan, 'M', 'F'],
                   'score' : [5, 4, 3, 4, np.nan]})
df

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0
4    F    NaN

In [7]:
pd.isna(df)

     sex  score
0  False  False
1  False  False
2   True  False
3  False  False
4  False   True

In [8]:
pd.isna(df).sum()

sex      1
score    1
dtype: int64

In [9]:
df['score']

0    5.0
1    4.0
2    3.0
3    4.0
4    NaN
Name: score, dtype: float64

In [10]:
df['score'] + 1

0    6.0
1    5.0
2    4.0
3    5.0
4    NaN
Name: score, dtype: float64

In [11]:
df.dropna(subset = 'score')

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0

In [12]:
df_nomiss = df.dropna(subset = 'score')

In [13]:
df_nomiss['score'].mean()

4.0

In [14]:
df_nomiss['score'].sum()

16.0

In [16]:
df_nomiss = df.dropna(subset = ['score', 'sex'])
df_nomiss

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [17]:
df_nomiss2 = df.dropna() # 모든 변수에 결측치 없는 데이터 추출
df_nomiss2

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

위의 경우 잘 사용하지 않지만 사용하는 때는
1. 100만개 이상의 행에서 결측치 데이터가 소량일때
2. 예측모델을 만들때 알고리즘 중에서 결측치 데이터가 있으면 사용하지 못할때

In [20]:
exam = pd.read_csv('exam.csv')
exam.loc[[2, 7, 14], ['math']] = np.nan
exam

    id  nclass  math  english  science
0    1       1  50.0       98       50
1    2       1  60.0       97       60
2    3       1   NaN       86       78
3    4       1  30.0       98       58
4    5       2  25.0       80       65
5    6       2  50.0       89       98
6    7       2  80.0       90       45
7    8       2   NaN       78       25
8    9       3  20.0       98       15
9   10       3  50.0       98       45
10  11       3  65.0       65       65
11  12       3  45.0       85       32
12  13       4  46.0       98       65
13  14       4  48.0       87       12
14  15       4   NaN       56       78
15  16       4  58.0       98       65
16  17       5  65.0       68       98
17  18       5  80.0       78       90
18  19       5  89.0       68       87
19  20       5  78.0       83       58

In [24]:
exam['math']

0     50.0
1     60.0
2      NaN
3     30.0
4     25.0
5     50.0
6     80.0
7      NaN
8     20.0
9     50.0
10    65.0
11    45.0
12    46.0
13    48.0
14     NaN
15    58.0
16    65.0
17    80.0
18    89.0
19    78.0
Name: math, dtype: float64

In [25]:
exam['math'].fillna(9999)

0       50.0
1       60.0
2     9999.0
3       30.0
4       25.0
5       50.0
6       80.0
7     9999.0
8       20.0
9       50.0
10      65.0
11      45.0
12      46.0
13      48.0
14    9999.0
15      58.0
16      65.0
17      80.0
18      89.0
19      78.0
Name: math, dtype: float64

In [26]:
exam['math'].mean()

55.23529411764706

In [27]:
exam['math'].fillna(exam['math'].mean())

0     50.000000
1     60.000000
2     55.235294
3     30.000000
4     25.000000
5     50.000000
6     80.000000
7     55.235294
8     20.000000
9     50.000000
10    65.000000
11    45.000000
12    46.000000
13    48.000000
14    55.235294
15    58.000000
16    65.000000
17    80.000000
18    89.000000
19    78.000000
Name: math, dtype: float64

In [28]:
exam['math'] = exam['math'].fillna(exam['math'].mean())

In [29]:
exam.isna().sum()

id         0
nclass     0
math       0
english    0
science    0
dtype: int64

mpg 데이터를 이용해서 분석 문제를 해결해 보세요.

mpg 데이터에는 결측치가 없습니다. 우선 mpg 데이터를 불러와서 일부러 몇 개의 값을 결측치로 만들겠습니다. 아래 코드를 실행하면 다섯 행의 hwy 변수에 NaN이 할당됩니다.

In [39]:
mpg = pd.read_csv('mpg.csv')                       # mpg 데이터 불러오기
mpg.loc[[65, 124, 131, 153, 212], 'hwy'] = np.nan  # NaN 할당하기

결측치가 들어 있는 mpg 데이터를 활용해 문제를 해결해 보세요.

Q1. drv(구동방식)별로 hwy(고속도로 연비) 평균이 어떻게 다른지 알아보려고 합니다. 분석을 하기 전에
        우선 두 변수에 결측치가 있는지 확인하려고 합니다. drv 변수와 hwy 변수에 결측치가 몇 개 있는지
        알아보세요.

In [40]:
mpg[['drv', 'hwy']].isna().sum()

drv    0
hwy    5
dtype: int64

Q2. df.dropna()를 이용해 hwy 변수의 결측치를 제거하고, 어떤 구동 방식의 hwy 평균이 높은지
        알아보세요. 하나의 pandas 구문으로 만들어야 합니다.

In [42]:
mpg.dropna(subset = 'hwy') \
   .groupby('drv') \
   .agg(mean_hwy = ('hwy', 'mean'))

      mean_hwy
drv
4    19.262626
f    28.009524
r    21.000000